tap "hashicorp/tap"
tap "mas-cli/mas"
tap "nikitabobko/tap"
brew "tree"
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "bat"
brew "btop"
brew "draft"
brew "duf"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "glow"
brew "gum"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lima"
brew "lsd"
brew "mas"
brew "micro"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "node"
brew "poppler"
brew "ripgrep"
brew "sevenzip"
brew "sshpass"
brew "starship"
brew "stow"
brew "tmux"
brew "whois"
brew "wimlib"
brew "yamllint"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
cask "1password"
cask "aerospace"
cask "alfred"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "coteditor"
cask "discord"
cask "filen"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "heynote"
cask "istat-menus"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kitty"
cask "maccy"
cask "megasync"
cask "microsoft-edge"
cask "music-decoy"
cask "obsidian"
cask "octarine"
cask "rectangle-pro"
cask "shottr"
cask "signal"
cask "spotify"
cask "sublime-text"
cask "textsniper"
cask "vscodium"
cask "wezterm"
cask "windows-app"
cask "zed"
cask "zen"
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Hand Mirror", id: 1502839586
vscode "aaron-bond.better-comments"
vscode "catppuccin.catppuccin-vsc"
vscode "esbenp.prettier-vscode"
vscode "jdinhlife.gruvbox"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "raillyhugo.one-hunter"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "zhuangtongfa.material-theme"
