tap "homebrew/bundle"
tap "mas-cli/mas"
brew "bat"
brew "btop"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lsd"
brew "mas"
brew "micro"
brew "neovim"
brew "poppler"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "alfred"
cask "busycal"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "heynote"
cask "inkdown"
cask "iterm2"
cask "karabiner-elements"
cask "maccy"
cask "masscode"
cask "obsidian"
cask "rectangle-pro"
cask "shottr"
cask "spotify"
cask "sublime-text"
cask "textsniper"
cask "todoist"
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Obsidian Web Clipper", id: 6720708363
mas "Pure Paste", id: 1611378436
mas "Things", id: 904280696
